_protected/frontend/controllers/LecturerController.php

    public function actionCreate()
    {
        $model = new Lecturer();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `lecturer` (`name`, `nip`, `email`) VALUES ('Ali Bardadi,S.SI., M.Kom', '1607102906880007', '09011181419030@student.unsri.ac.id')

    protected function findModel($id)
    {
        if (($model = Lecturer::findOne($id)) !== null) {
---
SELECT * FROM `lecturer` WHERE `id`='2'