_protected/frontend/controllers/SendmailController.php

SELECT EXISTS(SELECT * FROM `lecturer` WHERE `lecturer`.`id`='2')
SELECT * FROM `lecturer`
INSERT INTO `sendmail` (`lecturer_id`, `subject`, `body`, `created_at`, `updated_at`) VALUES (2, 'Test', 'Test', 1542388188, 1542388188)
---
    public function actionCreate()
    {
        $model = new Sendmail();
        $lecturer = ArrayHelper::map(\common\models\Lecturer::find()->asArray()->all(), 'id', 'name');

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `sendmail` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Sendmail::findOne($id)) !== null) {